RT-Thread/rt-thread/bsp/stm32/libraries/STM32H7RSxx_HAL/STM32H7RSxx_HAL_Driver/Src/stm32h7rsxx_hal_rcc_ex.c
  /* Get the ADC clock source ------------------------------------------------*/
  PeriphClkInit->AdcClockSelection          = __HAL_RCC_GET_ADC_SOURCE();
  /* Get the ADF1 clock source -----------------------------------------------*/
  PeriphClkInit->Adf1ClockSelection         = __HAL_RCC_GET_ADF1_SOURCE();
  /* Get the CEC clock source ------------------------------------------------*/
  PeriphClkInit->CecClockSelection          = __HAL_RCC_GET_CEC_SOURCE();
  /* Get the CKPER clock source ----------------------------------------------*/
  PeriphClkInit->CkperClockSelection        = __HAL_RCC_GET_CLKP_SOURCE();
  /* Get the ETH1 clock source ----------------------------------------------*/
  PeriphClkInit->Eth1RefClockSelection      = __HAL_RCC_GET_ETH1REF_SOURCE();
  /* Get the ETH1PHY clock source ----------------------------------------------*/
  PeriphClkInit->Eth1PhyClockSelection      = __HAL_RCC_GET_ETH1PHY_SOURCE();
  /* Get the FDCAN kernel clock source ---------------------------------------*/
  PeriphClkInit->FdcanClockSelection        = __HAL_RCC_GET_FDCAN_SOURCE();
  /* Get the FMC kernel clock source -----------------------------------------*/
  PeriphClkInit->FmcClockSelection          = __HAL_RCC_GET_FMC_SOURCE();
  /* Get the I2C1 clock source -----------------------------------------------*/
  PeriphClkInit->I2c1_I3c1ClockSelection    = __HAL_RCC_GET_I2C1_I3C1_SOURCE();
  /* Get the I2C2/I2C3 clock source ------------------------------------------*/
  PeriphClkInit->I2c23ClockSelection        = __HAL_RCC_GET_I2C23_SOURCE();
  /* Get the LPTIM1 clock source ---------------------------------------------*/
  PeriphClkInit->Lptim1ClockSelection       = __HAL_RCC_GET_LPTIM1_SOURCE();
  /* Get the LPTIM2/LPTIM3 clock source --------------------------------------*/
  PeriphClkInit->Lptim23ClockSelection      = __HAL_RCC_GET_LPTIM23_SOURCE();
  /* Get the LPTIM4/LPTIM5 clock source --------------------------------------*/
  PeriphClkInit->Lptim45ClockSelection      = __HAL_RCC_GET_LPTIM45_SOURCE();
  /* Get the LPUART1 clock source --------------------------------------------*/
  PeriphClkInit->Lpuart1ClockSelection      = __HAL_RCC_GET_LPUART1_SOURCE();
  /* Get the LTDC clock source -----------------------------------------------*/
  PeriphClkInit->LtdcClockSelection         = __HAL_RCC_GET_LTDC_SOURCE();
  /* Get the XSPI1 clock source -----------------------------------------------*/
  PeriphClkInit->Xspi1ClockSelection        = __HAL_RCC_GET_XSPI1_SOURCE();
  /* Get the XSPI2 clock source -----------------------------------------------*/
  PeriphClkInit->Xspi2ClockSelection        = __HAL_RCC_GET_XSPI2_SOURCE();
  /* Get the PSSI clock source -----------------------------------------------*/
  PeriphClkInit->PssiClockSelection         = __HAL_RCC_GET_PSSI_SOURCE();
  /* Get the RTC clock source -----------------------------------------------*/
  PeriphClkInit->RTCClockSelection          = __HAL_RCC_GET_RTC_SOURCE();
  /* Get the SAI1 clock source -----------------------------------------------*/
  PeriphClkInit->Sai1ClockSelection         = __HAL_RCC_GET_SAI1_SOURCE();
  /* Get the SAI2 clock source -----------------------------------------------*/
  PeriphClkInit->Sai2ClockSelection         = __HAL_RCC_GET_SAI2_SOURCE();
  /* Get the SDMMC clock source ----------------------------------------------*/
  PeriphClkInit->Sdmmc12ClockSelection      = __HAL_RCC_GET_SDMMC12_SOURCE();
  /* Get the SPDIFRX clock source --------------------------------------------*/
  PeriphClkInit->SpdifrxClockSelection      = __HAL_RCC_GET_SPDIFRX_SOURCE();
  /* Get the SPI1 clock source -----------------------------------------------*/
  PeriphClkInit->Spi1ClockSelection         = __HAL_RCC_GET_SPI1_SOURCE();
  /* Get the SPI2/SPI3 clock source ------------------------------------------*/
  PeriphClkInit->Spi23ClockSelection        = __HAL_RCC_GET_SPI23_SOURCE();
  /* Get the SPI4/SPI5 clock source ------------------------------------------*/
  PeriphClkInit->Spi45ClockSelection        = __HAL_RCC_GET_SPI45_SOURCE();
  /* Get the SPI6 clock source -----------------------------------------------*/
  PeriphClkInit->Spi6ClockSelection         = __HAL_RCC_GET_SPI6_SOURCE();
  /* Get the TIM Prescaler configuration -------------------------------------*/
  if ((RCC->CFGR & RCC_CFGR_TIMPRE) == 0U)
  {
    PeriphClkInit->TIMPresSelection = RCC_TIMPRES_DISABLE;
  }
  else
  {
    PeriphClkInit->TIMPresSelection = RCC_TIMPRES_ENABLE;
  }
  /* Get the USART1 configuration --------------------------------------------*/
  PeriphClkInit->Usart1ClockSelection       = __HAL_RCC_GET_USART1_SOURCE();
  /* Get the USART2/USART3/UART4/UART5/UART7/UART8 clock source --------------*/
  PeriphClkInit->Usart234578ClockSelection  = __HAL_RCC_GET_USART234578_SOURCE();
  /* Get the USBPHYC clock source --------------------------------------------*/
  PeriphClkInit->UsbPhycClockSelection      = __HAL_RCC_GET_USBPHYC_SOURCE();
  /* Get the USB OTG FS clock source -----------------------------------------*/
  PeriphClkInit->UsbOtgFsClockSelection     = __HAL_RCC_GET_USBOTGFS_SOURCE();
}

/**
  * @brief  Return the peripheral clock frequency for a given peripheral (SAI..)
  * @note   Return 0 if peripheral clock identifier not managed by this API or
  *         if the selected clock source is not enabled (HSI, PLLs clock output..)
  * @param  PeriphClk: Peripheral clock identifier
  *         This parameter can be one of the following values:
  *            @arg RCC_PERIPHCLK_FMC         : FMC peripheral clock
  *            @arg RCC_PERIPHCLK_XSPI1       : Xspi1 peripheral clock
  *            @arg RCC_PERIPHCLK_XSPI2       : Xspi2 peripheral clock
  *            @arg RCC_PERIPHCLK_CKPER       : CKPER peripheral clock
  *            @arg RCC_PERIPHCLK_ADC         : ADC peripheral clock
  *            @arg RCC_PERIPHCLK_ADF1        : ADF1 peripheral clock
  *            @arg RCC_PERIPHCLK_CEC         : CEC peripheral clock
  *            @arg RCC_PERIPHCLK_ETH1REF     : ETH1REF peripheral clock
  *            @arg RCC_PERIPHCLK_ETH1PHY     : ETH1PHY peripheral clock
  *            @arg RCC_PERIPHCLK_FDCAN       : FDCAN peripheral clock
  *            @arg RCC_PERIPHCLK_I2C23       : I2C2/I2C3 peripheral clock
  *            @arg RCC_PERIPHCLK_I2C1_I3C1   : I2C1/I3C1 peripheral clock
  *            @arg RCC_PERIPHCLK_LPTIM1      : LPTIM1 peripheral clock
  *            @arg RCC_PERIPHCLK_LPTIM23     : LPTIM23 peripheral clock
  *            @arg RCC_PERIPHCLK_LPTIM45     : LPTIM45 peripheral clock
  *            @arg RCC_PERIPHCLK_LPUART1     : LPUART1 peripheral clock
  *            @arg RCC_PERIPHCLK_LTDC        : LTDC peripheral clock
  *            @arg RCC_PERIPHCLK_PSSI        : PSSI peripheral clock
  *            @arg RCC_PERIPHCLK_RTC         : RTC peripheral clock
  *            @arg RCC_PERIPHCLK_SAI1        : SAI1 peripheral clock
  *            @arg RCC_PERIPHCLK_SAI2        : SAI2 peripheral clock
  *            @arg RCC_PERIPHCLK_SDMMC12     : SDMMC12 peripheral clock
  *            @arg RCC_PERIPHCLK_SPDIFRX     : SPDIFRX peripheral clock
  *            @arg RCC_PERIPHCLK_SPI1        : SPI1 peripheral clock
  *            @arg RCC_PERIPHCLK_SPI23       : SPI2/SPI3 peripheral clock
  *            @arg RCC_PERIPHCLK_SPI45       : SPI4/SPI5 peripheral clock
  *            @arg RCC_PERIPHCLK_SPI6        : SPI6 peripheral clock
  *            @arg RCC_PERIPHCLK_USART1      : USART1 peripheral clock
  *            @arg RCC_PERIPHCLK_USART234578 : USART2/3/5/7/8 peripheral clock
  *            @arg RCC_PERIPHCLK_USBOTGFS    : USBOTGFS peripheral clock
  * @retval Frequency in KHz
  */
uint32_t HAL_RCCEx_GetPeriphCLKFreq(uint32_t PeriphClk)
{
  uint32_t frequency = 0; /* Set to 0 for returned value if no source clock */
  uint32_t clocksource;
  uint32_t ethclocksource;
  uint32_t prescaler;

