RT-Thread/rt-thread/bsp/stm32/libraries/STM32H7RSxx_HAL/STM32H7RSxx_HAL_Driver/Src/stm32h7rsxx_hal_rcc_ex.c
  switch (PeriphClk)
  {
    case RCC_PERIPHCLK_FMC:
      clocksource = __HAL_RCC_GET_FMC_SOURCE();

      switch (clocksource)
      {
        case RCC_FMCCLKSOURCE_HCLK: /* HCLK is the clock source for FMC kernel peripheral clock */
          frequency = HAL_RCC_GetHCLKFreq();
          break;
        case RCC_FMCCLKSOURCE_PLL1Q: /* PLL1 'Q' is the clock source for FMC kernel peripheral clock */
          if (__HAL_RCC_GET_PLL1CLKOUT_CONFIG(RCC_PLL_QCLK) != 0U)
          {
            frequency = HAL_RCC_GetPLL1QFreq();
          }
          break;
        case RCC_FMCCLKSOURCE_PLL2R: /* PLL2 'R' is the clock source for FMC kernel peripheral clock */
          if (__HAL_RCC_GET_PLL2CLKOUT_CONFIG(RCC_PLL_RCLK) != 0U)
          {
            frequency = HAL_RCC_GetPLL2RFreq();
          }
          break;
        case RCC_FMCCLKSOURCE_HSI: /* HSI is the clock source for FMC kernel peripheral clock */
          if (READ_BIT(RCC->CR, RCC_CR_HSIRDY) != 0U)
          {
            if (READ_BIT(RCC->CR, RCC_CR_HSIDIVF) != 0U)
            {
              frequency = (HSI_VALUE >> (__HAL_RCC_GET_HSI_DIVIDER() >> RCC_CR_HSIDIV_Pos));
            }
            else
            {
              /* Can't retrieve HSIDIV value */
            }
          }
          break;
        case RCC_FMCCLKSOURCE_HCLK_DIV4: /* HCLK/4 is the clock source for FMC kernel peripheral clock */
          frequency = (HAL_RCC_GetHCLKFreq() / 4U);
          break;
        default:
          /* Nothing to do, frequency is by default set to 0 */
          break;
      }
      break;

    case RCC_PERIPHCLK_XSPI1:
      clocksource = __HAL_RCC_GET_XSPI1_SOURCE();

      switch (clocksource)
      {
        case RCC_XSPI1CLKSOURCE_HCLK: /* HCLK is the clock source for XSPI1 kernel peripheral clock */
          frequency = HAL_RCC_GetHCLKFreq();
          break;
        case RCC_XSPI1CLKSOURCE_PLL2S: /* PLL2 'S' is the clock source for XSPI1 kernel peripheral clock */
          if (__HAL_RCC_GET_PLL2CLKOUT_CONFIG(RCC_PLL_SCLK) != 0U)
          {
            frequency = HAL_RCC_GetPLL2SFreq();
          }
          break;
        case RCC_XSPI1CLKSOURCE_PLL2T: /* PLL2 'T' is the clock source for XSPI1 kernel peripheral clock */
          if (__HAL_RCC_GET_PLL2CLKOUT_CONFIG(RCC_PLL_TCLK) != 0U)
          {
            frequency = HAL_RCC_GetPLL2TFreq();
          }
          break;
        case RCC_XSPI1CLKSOURCE_HCLK_DIV4: /* HCLK/4 is the clock source for XSPI1 kernel peripheral clock */
          frequency = (HAL_RCC_GetHCLKFreq() / 4U);
          break;
        default:
          /* Nothing to do, frequency is by default set to 0 */
          break;
      }
      break;

    case RCC_PERIPHCLK_XSPI2:
      clocksource = __HAL_RCC_GET_XSPI2_SOURCE();

      switch (clocksource)
      {
        case RCC_XSPI2CLKSOURCE_HCLK: /* HCLK is the clock source for XSPI2 kernel peripheral clock */
          frequency = HAL_RCC_GetHCLKFreq();
          break;
        case RCC_XSPI2CLKSOURCE_PLL2S: /* PLL2 'S' is the clock source for XSPI2 kernel peripheral clock */
          if (__HAL_RCC_GET_PLL2CLKOUT_CONFIG(RCC_PLL_SCLK) != 0U)
          {
            frequency = HAL_RCC_GetPLL2SFreq();
          }
          break;
        case RCC_XSPI2CLKSOURCE_PLL2T: /* PLL2 'T' is the clock source for XSPI2 kernel peripheral clock */
          if (__HAL_RCC_GET_PLL2CLKOUT_CONFIG(RCC_PLL_TCLK) != 0U)
          {
            frequency = HAL_RCC_GetPLL2TFreq();
          }
          break;
        case RCC_XSPI2CLKSOURCE_HCLK_DIV4: /* HCLK/4 is the clock source for XSPI2 kernel peripheral clock */
          frequency = (HAL_RCC_GetHCLKFreq() / 4U);
          break;
        default:
          /* Nothing to do, frequency is by default set to 0 */
          break;
      }
      break;

    case RCC_PERIPHCLK_CKPER:
      clocksource = __HAL_RCC_GET_CLKP_SOURCE();

      switch (clocksource)
      {
        case RCC_CLKPSOURCE_HSI: /* HSI is the clock source for CKPER */
          if (READ_BIT(RCC->CR, RCC_CR_HSIRDY) != 0U)
          {
            if (READ_BIT(RCC->CR, RCC_CR_HSIDIVF) != 0U)
            {
              frequency = (HSI_VALUE >> (__HAL_RCC_GET_HSI_DIVIDER() >> RCC_CR_HSIDIV_Pos));
            }
            else
            {
              /* Can't retrieve HSIDIV value */
            }
          }
          break;
        case RCC_CLKPSOURCE_CSI: /* CSI is the clock source for CKPER */
          if (READ_BIT(RCC->CR, RCC_CR_CSIRDY) != 0U)
          {
            frequency = CSI_VALUE;
          }
          break;
        case RCC_CLKPSOURCE_HSE: /* HSE is the clock source for CKPER */
          if (READ_BIT(RCC->CR, RCC_CR_HSERDY) != 0U)
          {
            frequency = HSE_VALUE;
          }
          break;

        default:
          /* Nothing to do, frequency is by default set to 0 */
          break;
      }
      break;

    case RCC_PERIPHCLK_ADC:
      clocksource = __HAL_RCC_GET_ADC_SOURCE();

      switch (clocksource)
      {
        case RCC_ADCCLKSOURCE_PLL2P: /* PLL2 'P' is the clock source for ADC */
          if (__HAL_RCC_GET_PLL2CLKOUT_CONFIG(RCC_PLL_PCLK) != 0U)
          {
            frequency = HAL_RCC_GetPLL2PFreq();
          }
          break;
        case RCC_ADCCLKSOURCE_PLL3R: /* PLL3 'R' is the clock source for ADC */
          if (__HAL_RCC_GET_PLL3CLKOUT_CONFIG(RCC_PLL_RCLK) != 0U)
          {
            frequency = HAL_RCC_GetPLL3RFreq();
          }
          break;
        case RCC_ADCCLKSOURCE_CLKP: /* CKPER is the clock source for ADC */
          frequency = RCC_GetCLKPFreq();
          break;
        default:
          /* Nothing to do, frequency is by default set to 0 */
          break;
      }
      break;

    case RCC_PERIPHCLK_ADF1:
      clocksource = __HAL_RCC_GET_ADF1_SOURCE();

      switch (clocksource)
      {
        case RCC_ADF1CLKSOURCE_HCLK: /* HCLK is the clock source for ADF1 */
          frequency = HAL_RCC_GetHCLKFreq();
          break;
        case RCC_ADF1CLKSOURCE_PLL2P: /* PLL2 'P' is the clock source for ADF1 */
          if (__HAL_RCC_GET_PLL2CLKOUT_CONFIG(RCC_PLL_PCLK) != 0U)
          {
            frequency = HAL_RCC_GetPLL2PFreq();
          }
          break;
        case RCC_ADF1CLKSOURCE_PLL3P: /* PLL3 'P' is the clock source for ADF1 */
          if (__HAL_RCC_GET_PLL3CLKOUT_CONFIG(RCC_PLL_PCLK) != 0U)
          {
            frequency = HAL_RCC_GetPLL3PFreq();
          }
          break;
        case RCC_ADF1CLKSOURCE_PIN: /* External I2S_CKIN is used as clock source for ADF1 */
          frequency = EXTERNAL_CLOCK_VALUE;
          break;
        case RCC_ADF1CLKSOURCE_CSI: /* CSI is the clock source for ADF1 */
          if (READ_BIT(RCC->CR, RCC_CR_CSIRDY) != 0U)
          {
            frequency = CSI_VALUE;
          }
          break;
        case RCC_ADF1CLKSOURCE_HSI: /* HSI is the clock source for ADF1 */
          if (READ_BIT(RCC->CR, RCC_CR_HSIRDY) != 0U)
          {
            if (READ_BIT(RCC->CR, RCC_CR_HSIDIVF) != 0U)
            {
              frequency = (HSI_VALUE >> (__HAL_RCC_GET_HSI_DIVIDER() >> RCC_CR_HSIDIV_Pos));
            }
            else
            {
              /* Can't retrieve HSIDIV value */
            }
          }
          break;
        default:
          /* Nothing to do, frequency is by default set to 0 */
          break;
      }
      break;

