RT-Thread/rt-thread/bsp/stm32/libraries/STM32H7RSxx_HAL/STM32H7RSxx_HAL_Driver/Src/stm32h7rsxx_hal_rcc_ex.c
    case RCC_PERIPHCLK_CEC:
      clocksource = __HAL_RCC_GET_CEC_SOURCE();

      switch (clocksource)
      {
        case RCC_CECCLKSOURCE_LSE: /* LSE is the clock source for CEC */
          if (READ_BIT(RCC->BDCR, RCC_BDCR_LSERDY) != 0U)
          {
            frequency = LSE_VALUE;
          }
          break;
        case RCC_CECCLKSOURCE_LSI: /* LSI is the clock source for CEC */
          if (READ_BIT(RCC->CSR, RCC_CSR_LSIRDY) != 0U)
          {
            frequency = LSI_VALUE;
          }
          break;
        case RCC_CECCLKSOURCE_CSI: /* CSI is the clock source for CEC */
          if (READ_BIT(RCC->CR, RCC_CR_CSIRDY) != 0U)
          {
            frequency = CSI_VALUE;
          }
          break;
        default:
          /* Nothing to do, frequency is by default set to 0 */
          break;
      }
      break;

    case RCC_PERIPHCLK_ETH1REF:
      clocksource = __HAL_RCC_GET_ETH1REF_SOURCE();

      switch (clocksource)
      {
        case RCC_ETH1REFCLKSOURCE_PHY: /* PHY is the clock source for ETH1REF */
          /* Can't retrieve this source's frequency, it is by default set to 0 */
          break;
        case RCC_ETH1REFCLKSOURCE_HSE: /* HSE is the clock source for ETH1REF */
          if (READ_BIT(RCC->CR, RCC_CR_HSERDY) != 0U)
          {
            frequency = HSE_VALUE;
          }
          break;
        case RCC_ETH1REFCLKSOURCE_ETH: /* ETH is the clock source for ETH1REF */
          ethclocksource = __HAL_RCC_GET_ETH1PHY_SOURCE();

          switch (ethclocksource)
          {
            case RCC_ETH1PHYCLKSOURCE_HSE:
              if (READ_BIT(RCC->CR, RCC_CR_HSERDY) != 0U)
              {
                frequency = HSE_VALUE;
              }
              break;
            case RCC_ETH1PHYCLKSOURCE_PLL3S:
              if (__HAL_RCC_GET_PLL3CLKOUT_CONFIG(RCC_PLL_SCLK) != 0U)
              {
                frequency = HAL_RCC_GetPLL3SFreq();
              }
              break;
            default:
              /* Nothing to do, frequency is by default set to 0 */
              break;
          }
          break;
        default:
          /* Nothing to do, frequency is by default set to 0 */
          break;
      }
      break;

    case RCC_PERIPHCLK_ETH1PHY:
      clocksource = __HAL_RCC_GET_ETH1PHY_SOURCE();

      switch (clocksource)
      {
        case RCC_ETH1PHYCLKSOURCE_HSE:
          if (READ_BIT(RCC->CR, RCC_CR_HSERDY) != 0U)
          {
            frequency = HSE_VALUE;
          }
          break;
        case RCC_ETH1PHYCLKSOURCE_PLL3S:
          if (__HAL_RCC_GET_PLL3CLKOUT_CONFIG(RCC_PLL_SCLK) != 0U)
          {
            frequency = HAL_RCC_GetPLL3SFreq();
          }
          break;
        default:
          /* Nothing to do, frequency is by default set to 0 */
          break;
      }
      break;

    case RCC_PERIPHCLK_FDCAN:
      clocksource = __HAL_RCC_GET_FDCAN_SOURCE();

      switch (clocksource)
      {
        case RCC_FDCANCLKSOURCE_HSE: /*!< HSE is the clock source for FDCAN */
          if (READ_BIT(RCC->CR, RCC_CR_HSERDY) != 0U)
          {
            frequency = HSE_VALUE;
          }
          break;
        case RCC_FDCANCLKSOURCE_PLL1Q: /*!< PLL1 'Q' ois the clock source for FDCAN */
          if (__HAL_RCC_GET_PLL1CLKOUT_CONFIG(RCC_PLL_QCLK) != 0U)
          {
            frequency = HAL_RCC_GetPLL1QFreq();
          }
          break;
        case RCC_FDCANCLKSOURCE_PLL2P: /*!< PLL2 'P' is the clock source for FDCAN */
          if (__HAL_RCC_GET_PLL2CLKOUT_CONFIG(RCC_PLL_PCLK) != 0U)
          {
            frequency = HAL_RCC_GetPLL2PFreq();
          }
          break;
        default:
          /* Nothing to do, frequency is by default set to 0 */
          break;
      }
      break;

    case RCC_PERIPHCLK_I2C23:
      clocksource = __HAL_RCC_GET_I2C23_SOURCE();

      switch (clocksource)
      {
        case RCC_I2C23CLKSOURCE_PCLK1: /*!< PCLK1 is the clock source for I2C23 */
          frequency = HAL_RCC_GetPCLK1Freq();
          break;
        case RCC_I2C23CLKSOURCE_PLL3R: /*!< PLL3R is the clock source for I2C23 */
          if (__HAL_RCC_GET_PLL3CLKOUT_CONFIG(RCC_PLL_RCLK) != 0U)
          {
            frequency = HAL_RCC_GetPLL3RFreq();
          }
          break;
        case RCC_I2C23CLKSOURCE_HSI: /*!< HSI is the clock source for I2C23 */
          if (READ_BIT(RCC->CR, RCC_CR_HSIRDY) != 0U)
          {
            if (READ_BIT(RCC->CR, RCC_CR_HSIDIVF) != 0U)
            {
              frequency = (HSI_VALUE >> (__HAL_RCC_GET_HSI_DIVIDER() >> RCC_CR_HSIDIV_Pos));
            }
            else
            {
              /* Can't retrieve HSIDIV value */
            }
          }
          break;
        case RCC_I2C23CLKSOURCE_CSI: /*!< CSI is the clock source for I2C23 */
          if (READ_BIT(RCC->CR, RCC_CR_CSIRDY) != 0U)
          {
            frequency = CSI_VALUE;
          }
          break;
        default:
          /* Nothing to do, frequency is by default set to 0 */
          break;
      }
      break;

    case RCC_PERIPHCLK_I2C1_I3C1:
      clocksource = __HAL_RCC_GET_I2C1_I3C1_SOURCE();

      switch (clocksource)
      {
        case RCC_I2C1_I3C1CLKSOURCE_PCLK1: /*!< PCLK1 is the clock source for I2C1/I3C1 */
          frequency = HAL_RCC_GetPCLK1Freq();
          break;
        case RCC_I2C1_I3C1CLKSOURCE_PLL3R: /*!< PLL3 'R' is the clock source for I2C1/I3C1 */
          if (__HAL_RCC_GET_PLL3CLKOUT_CONFIG(RCC_PLL_RCLK) != 0U)
          {
            frequency = HAL_RCC_GetPLL3RFreq();
          }
          break;
        case RCC_I2C1_I3C1CLKSOURCE_HSI: /*!< HSI is the clock source for I2C1/I3C1 */
          if (READ_BIT(RCC->CR, RCC_CR_HSIRDY) != 0U)
          {
            if (READ_BIT(RCC->CR, RCC_CR_HSIDIVF) != 0U)
            {
              frequency = (HSI_VALUE >> (__HAL_RCC_GET_HSI_DIVIDER() >> RCC_CR_HSIDIV_Pos));
            }
            else
            {
              /* Can't retrieve HSIDIV value */
            }
          }
          break;
        case RCC_I2C1_I3C1CLKSOURCE_CSI: /*!< CSI is the clock source for I2C1/I3C1 */
          if (READ_BIT(RCC->CR, RCC_CR_CSIRDY) != 0U)
          {
            frequency = CSI_VALUE;
          }
          break;
        default:
          /* Nothing to do, frequency is by default set to 0 */
          break;
      }
      break;

    case RCC_PERIPHCLK_LPTIM1:
      clocksource = __HAL_RCC_GET_LPTIM1_SOURCE();

      switch (clocksource)
      {
        case RCC_LPTIM1CLKSOURCE_PCLK1: /* PCLK1 is the clock source for LPTIM1 */
          frequency = HAL_RCC_GetPCLK1Freq();
          break;
        case RCC_LPTIM1CLKSOURCE_PLL2P: /* PLL2 'P' is the clock source for LPTIM1 */
          if (__HAL_RCC_GET_PLL2CLKOUT_CONFIG(RCC_PLL_PCLK) != 0U)
          {
            frequency = HAL_RCC_GetPLL2PFreq();
          }
          break;
        case RCC_LPTIM1CLKSOURCE_PLL3R: /* PLL3 'R' is the clock source for LPTIM1 */
          if (__HAL_RCC_GET_PLL3CLKOUT_CONFIG(RCC_PLL_RCLK) != 0U)
          {
            frequency = HAL_RCC_GetPLL3RFreq();
          }
          break;
        case RCC_LPTIM1CLKSOURCE_LSE: /* LSE is the clock source for LPTIM1 */
          if (READ_BIT(RCC->BDCR, RCC_BDCR_LSERDY) != 0U)
          {
            frequency = LSE_VALUE;
          }
          break;
        case RCC_LPTIM1CLKSOURCE_LSI: /* LSI is the clock source for LPTIM1 */
          if (READ_BIT(RCC->CSR, RCC_CSR_LSIRDY) != 0U)
          {
            frequency = LSI_VALUE;
          }
          break;
        case RCC_LPTIM1CLKSOURCE_CLKP: /* CKPER is the clock source for LPTIM1 */
          frequency = RCC_GetCLKPFreq();
          break;
        default:
          /* Nothing to do, frequency is by default set to 0 */
          break;
      }
      break;

    case RCC_PERIPHCLK_LPTIM23:
      clocksource = __HAL_RCC_GET_LPTIM23_SOURCE();

      switch (clocksource)
      {
        case RCC_LPTIM23CLKSOURCE_PCLK4: /* PCLK4 is the clock source for LPTIM2/LPTIM3 */
          frequency = HAL_RCC_GetPCLK4Freq();
          break;
        case RCC_LPTIM23CLKSOURCE_PLL2P: /* PLL2 'P' is the clock source for LPTIM2/LPTIM3 */
          if (__HAL_RCC_GET_PLL2CLKOUT_CONFIG(RCC_PLL_PCLK) != 0U)
          {
            frequency = HAL_RCC_GetPLL2PFreq();
          }
          break;
        case RCC_LPTIM23CLKSOURCE_PLL3R: /* PLL3 'R' is the clock source for LPTIM2/LPTIM3 */
          if (__HAL_RCC_GET_PLL3CLKOUT_CONFIG(RCC_PLL_RCLK) != 0U)
          {
            frequency = HAL_RCC_GetPLL3RFreq();
          }
          break;
        case RCC_LPTIM23CLKSOURCE_LSE: /* LSE is the clock source for LPTIM2/LPTIM3 */
          if (READ_BIT(RCC->BDCR, RCC_BDCR_LSERDY) != 0U)
          {
            frequency = LSE_VALUE;
          }
          break;
        case RCC_LPTIM23CLKSOURCE_LSI: /* LSI is the clock source for LPTIM2/LPTIM3 */
          if (READ_BIT(RCC->CSR, RCC_CSR_LSIRDY) != 0U)
          {
            frequency = LSI_VALUE;
          }
          break;
        case RCC_LPTIM23CLKSOURCE_CLKP: /* CKPER is the clock source for LPTIM2/LPTIM3 */
          frequency = RCC_GetCLKPFreq();
          break;
        default:
          /* Nothing to do, frequency is by default set to 0 */
          break;
      }
      break;

    case RCC_PERIPHCLK_LPTIM45:
      clocksource = __HAL_RCC_GET_LPTIM45_SOURCE();

      switch (clocksource)
      {
        case RCC_LPTIM45CLKSOURCE_PCLK4: /* PCLK4 is the clock source for LPTIM4/LPTIM5 */
          frequency = HAL_RCC_GetPCLK4Freq();
          break;
        case RCC_LPTIM45CLKSOURCE_PLL2P: /* PLL2 'P' is the clock source for LPTIM4/LPTIM5 */
          if (__HAL_RCC_GET_PLL2CLKOUT_CONFIG(RCC_PLL_PCLK) != 0U)
          {
            frequency = HAL_RCC_GetPLL2PFreq();
          }
          break;
        case RCC_LPTIM45CLKSOURCE_PLL3R: /* PLL3 'R' is the clock source for LPTIM4/LPTIM5 */
          if (__HAL_RCC_GET_PLL3CLKOUT_CONFIG(RCC_PLL_RCLK) != 0U)
          {
            frequency = HAL_RCC_GetPLL3RFreq();
          }
          break;
        case RCC_LPTIM45CLKSOURCE_LSE: /* LSE is the clock source for LPTIM4/LPTIM5 */
          if (READ_BIT(RCC->BDCR, RCC_BDCR_LSERDY) != 0U)
          {
            frequency = LSE_VALUE;
          }
          break;
        case RCC_LPTIM45CLKSOURCE_LSI: /* LSI is the clock source for LPTIM4/LPTIM5 */
          if (READ_BIT(RCC->CSR, RCC_CSR_LSIRDY) != 0U)
          {
            frequency = LSI_VALUE;
          }
          break;
        case RCC_LPTIM45CLKSOURCE_CLKP: /* CKPER is the clock source for LPTIM4/LPTIM5 */
          frequency = RCC_GetCLKPFreq();
          break;
        default:
          /* Nothing to do, frequency is by default set to 0 */
          break;
      }
      break;

    case RCC_PERIPHCLK_LPUART1:
      clocksource = __HAL_RCC_GET_LPUART1_SOURCE();

      switch (clocksource)
      {
        case RCC_LPUART1CLKSOURCE_PCLK4: /*!< PCLK4 is the clock source for LPUART1 */
          frequency = HAL_RCC_GetPCLK4Freq();
          break;
        case RCC_LPUART1CLKSOURCE_PLL2Q: /*!< PLL2 'Q' is the clock source for LPUART1 */
          if (__HAL_RCC_GET_PLL2CLKOUT_CONFIG(RCC_PLL_QCLK) != 0U)
          {
            frequency = HAL_RCC_GetPLL2QFreq();
          }
          break;
        case RCC_LPUART1CLKSOURCE_PLL3Q: /*!< PLL3 'Q' is the clock source for LPUART1 */
          if (__HAL_RCC_GET_PLL3CLKOUT_CONFIG(RCC_PLL_QCLK) != 0U)
          {
            frequency = HAL_RCC_GetPLL3QFreq();
          }
          break;
        case RCC_LPUART1CLKSOURCE_HSI: /*!< HSI is the clock source for LPUART1 */
          if (READ_BIT(RCC->CR, RCC_CR_HSIRDY) != 0U)
          {
            if (READ_BIT(RCC->CR, RCC_CR_HSIDIVF) != 0U)
            {
              frequency = (HSI_VALUE >> (__HAL_RCC_GET_HSI_DIVIDER() >> RCC_CR_HSIDIV_Pos));
            }
            else
            {
              /* Can't retrieve HSIDIV value */
            }
          }
          break;
        case RCC_LPUART1CLKSOURCE_CSI: /*!< CSI is the clock source for LPUART1 */
          if (READ_BIT(RCC->CR, RCC_CR_CSIRDY) != 0U)
          {
            frequency = CSI_VALUE;
          }
          break;
        case RCC_LPUART1CLKSOURCE_LSE: /*!< LSE is the clock source for LPUART1 */
          if (READ_BIT(RCC->BDCR, RCC_BDCR_LSERDY) != 0U)
          {
            frequency = LSE_VALUE;
          }
          break;
        default:
          /* Nothing to do, frequency is by default set to 0 */
          break;
      }
      break;

    case RCC_PERIPHCLK_LTDC:
      /* Unique PLL3 'R' clock source */
      if (__HAL_RCC_GET_PLL3CLKOUT_CONFIG(RCC_PLL_RCLK) != 0U)
      {
        frequency = HAL_RCC_GetPLL3RFreq();
      }
      break;

    case RCC_PERIPHCLK_PSSI:
      clocksource = __HAL_RCC_GET_PSSI_SOURCE();

      switch (clocksource)
      {
        case RCC_PSSICLKSOURCE_PLL3R: /*!< PLL3 'R' is the clock source for PSSI */
          if (__HAL_RCC_GET_PLL3CLKOUT_CONFIG(RCC_PLL_RCLK) != 0U)
          {
            frequency = HAL_RCC_GetPLL3RFreq();
          }
          break;
        case RCC_PSSICLKSOURCE_CLKP: /*!< CLKP is the clock source for PSSI */
          frequency = RCC_GetCLKPFreq();
          break;
        default:
          /* Nothing to do, frequency is by default set to 0 */
          break;
      }
      break;

    case RCC_PERIPHCLK_RTC:
      clocksource = __HAL_RCC_GET_RTC_SOURCE();

      switch (clocksource)
      {
        case RCC_RTCCLKSOURCE_DISABLE:
          /* Nothing to do, frequency is by default set to 0 */
          break;
        case RCC_RTCCLKSOURCE_LSE: /*!< LSE is the clock source for RTC */
          if (READ_BIT(RCC->BDCR, RCC_BDCR_LSERDY) != 0U)
          {
            frequency = LSE_VALUE;
          }
          break;
        case RCC_RTCCLKSOURCE_LSI: /*!< LSI is the clock source for RTC */
          if (READ_BIT(RCC->CSR, RCC_CSR_LSIRDY) != 0U)
          {
            frequency = LSI_VALUE;
          }
          break;
        default:
          if (READ_BIT(RCC->BDCR, RCC_BDCR_RTCSEL) == RCC_BDCR_RTCSEL) /*!< HSE is the clock source for RTC */
          {
            if (READ_BIT(RCC->CR, RCC_CR_HSERDY) != 0U)
            {
              prescaler = READ_BIT(RCC->CFGR, RCC_CFGR_RTCPRE) >> RCC_CFGR_RTCPRE_Pos;
              if (prescaler > 1U)
              {
                frequency = HSE_VALUE / prescaler;
              }
            }
          }
          else
          {
            /* Nothing to do, frequency is by default set to 0 */
          }
          break;
      }
      break;

    case RCC_PERIPHCLK_SAI1:
      clocksource = __HAL_RCC_GET_SAI1_SOURCE();

      switch (clocksource)
      {
        case RCC_SAI1CLKSOURCE_PLL1Q: /* PLL1 'Q' is the clock source for SAI1 */
          if (__HAL_RCC_GET_PLL1CLKOUT_CONFIG(RCC_PLL_QCLK) != 0U)
          {
            frequency = HAL_RCC_GetPLL1QFreq();
          }
          break;
        case RCC_SAI1CLKSOURCE_PLL2P: /* PLL2 'P' is the clock source for SAI1 */
          if (__HAL_RCC_GET_PLL2CLKOUT_CONFIG(RCC_PLL_PCLK) != 0U)
          {
            frequency = HAL_RCC_GetPLL2PFreq();
          }
          break;
        case RCC_SAI1CLKSOURCE_PLL3P: /* PLL3 'P' is the clock source for SAI1 */
          if (__HAL_RCC_GET_PLL3CLKOUT_CONFIG(RCC_PLL_PCLK) != 0U)
          {
            frequency = HAL_RCC_GetPLL3PFreq();
          }
          break;
        case RCC_SAI1CLKSOURCE_CLKP: /* CKPER is the clock source for SAI1 */
          frequency = RCC_GetCLKPFreq();
          break;
        case RCC_SAI1CLKSOURCE_PIN: /* External clock is the clock source for SAI1 */
          frequency = EXTERNAL_CLOCK_VALUE;
          break;
        default:
          /* Nothing to do, frequency is by default set to 0 */
          break;
      }
      break;

    case RCC_PERIPHCLK_SAI2:
      clocksource = __HAL_RCC_GET_SAI2_SOURCE();

      switch (clocksource)
      {
        case RCC_SAI2CLKSOURCE_PLL1Q: /* PLL1 'Q' is the clock source for SAI2 */
          if (__HAL_RCC_GET_PLL1CLKOUT_CONFIG(RCC_PLL_QCLK) != 0U)
          {
            frequency = HAL_RCC_GetPLL1QFreq();
          }
          break;
        case RCC_SAI2CLKSOURCE_PLL2P: /* PLL2 'P' is the clock source for SAI2 */
          if (__HAL_RCC_GET_PLL2CLKOUT_CONFIG(RCC_PLL_PCLK) != 0U)
          {
            frequency = HAL_RCC_GetPLL2PFreq();
          }
          break;
        case RCC_SAI2CLKSOURCE_PLL3P: /* PLL3 'P' is the clock source for SAI2 */
          if (__HAL_RCC_GET_PLL3CLKOUT_CONFIG(RCC_PLL_PCLK) != 0U)
          {
            frequency = HAL_RCC_GetPLL3PFreq();
          }
          break;
        case RCC_SAI2CLKSOURCE_CLKP: /* CKPER is the clock source for SAI2 */
          frequency = RCC_GetCLKPFreq();
          break;
        case RCC_SAI2CLKSOURCE_SPDIF:
          /* Can't retrieve this source's frequency, it is by default set to 0 */
          break;
        case RCC_SAI2CLKSOURCE_PIN: /* External clock is the clock source for SAI2 */
          frequency = EXTERNAL_CLOCK_VALUE;
          break;
        default:
          /* Nothing to do, frequency is by default set to 0 */
          break;
      }
      break;

    case RCC_PERIPHCLK_SDMMC12: /* SDMMC1 and SDMMC2 */

      clocksource = __HAL_RCC_GET_SDMMC12_SOURCE();

