RT-Thread/rt-thread/bsp/stm32/libraries/STM32H7RSxx_HAL/STM32H7RSxx_HAL_Driver/Src/stm32h7rsxx_hal_rcc_ex.c
      if (clocksource ==
          RCC_SDMMC12CLKSOURCE_PLL2S) /* PLL2 'S' is the clock source for SDMMC1 and SDMMC2 kernel peripheral clock */
      {
        if (__HAL_RCC_GET_PLL2CLKOUT_CONFIG(RCC_PLL_SCLK) != 0U)
        {
          frequency = HAL_RCC_GetPLL2SFreq();
        }
      }
      else /* PLL2 'T' is the clock source for SDMMC1 and SDMMC2 kernel peripheral clock */
      {
        if (__HAL_RCC_GET_PLL2CLKOUT_CONFIG(RCC_PLL_TCLK) != 0U)
        {
          frequency = HAL_RCC_GetPLL2TFreq();
        }
      }
      break;

    case RCC_PERIPHCLK_SPDIFRX:
      clocksource = __HAL_RCC_GET_SPDIFRX_SOURCE();

      switch (clocksource)
      {
        case RCC_SPDIFRXCLKSOURCE_PLL1Q: /* PLL1 'Q' is the clock source for SPDIFRX */
          if (__HAL_RCC_GET_PLL1CLKOUT_CONFIG(RCC_PLL_QCLK) != 0U)
          {
            frequency = HAL_RCC_GetPLL1QFreq();
          }
          break;
        case RCC_SPDIFRXCLKSOURCE_PLL2R: /* PLL2 'R' is the clock source for SPDIFRX */
          if (__HAL_RCC_GET_PLL2CLKOUT_CONFIG(RCC_PLL_RCLK) != 0U)
          {
            frequency = HAL_RCC_GetPLL2RFreq();
          }
          break;
        case RCC_SPDIFRXCLKSOURCE_PLL3R: /* PLL3 'R' is the clock source for SPDIFRX */
          if (__HAL_RCC_GET_PLL3CLKOUT_CONFIG(RCC_PLL_RCLK) != 0U)
          {
            frequency = HAL_RCC_GetPLL3RFreq();
          }
          break;
        case RCC_SPDIFRXCLKSOURCE_HSI: /* HSI is the clock source for SPDIFRX */
          if (READ_BIT(RCC->CR, RCC_CR_HSIRDY) != 0U)
          {
            if (READ_BIT(RCC->CR, RCC_CR_HSIDIVF) != 0U)
            {
              frequency = (HSI_VALUE >> (__HAL_RCC_GET_HSI_DIVIDER() >> RCC_CR_HSIDIV_Pos));
            }
            else
            {
              /* Can't retrieve HSIDIV value */
            }
          }
          break;
        default:
          /* Nothing to do, frequency is by default set to 0 */
          break;
      }
      break;

    case RCC_PERIPHCLK_SPI1:
      clocksource = __HAL_RCC_GET_SPI1_SOURCE();

      switch (clocksource)
      {
        case RCC_SPI1CLKSOURCE_PLL1Q: /* PLL1 'Q' is the clock source for SPI1 */
          if (__HAL_RCC_GET_PLL1CLKOUT_CONFIG(RCC_PLL_QCLK) != 0U)
          {
            frequency = HAL_RCC_GetPLL1QFreq();
          }
          break;
        case RCC_SPI1CLKSOURCE_PLL2P: /* PLL2 'P' is the clock source for SPI1 */
          if (__HAL_RCC_GET_PLL2CLKOUT_CONFIG(RCC_PLL_PCLK) != 0U)
          {
            frequency = HAL_RCC_GetPLL2PFreq();
          }
          break;
        case RCC_SPI1CLKSOURCE_PLL3P: /* PLL3 'P' is the clock source for SPI1 */
          if (__HAL_RCC_GET_PLL3CLKOUT_CONFIG(RCC_PLL_PCLK) != 0U)
          {
            frequency = HAL_RCC_GetPLL3PFreq();
          }
          break;
        case RCC_SPI1CLKSOURCE_CLKP: /* CKPER is the clock source for SPI1 */
          frequency = RCC_GetCLKPFreq();
          break;
        case RCC_SPI1CLKSOURCE_PIN: /* External I2S_CKIN is used as clock source for SPI1 */
          frequency = EXTERNAL_CLOCK_VALUE;
          break;
        default:
          /* Nothing to do, frequency is by default set to 0 */
          break;
      }
      break;

    case RCC_PERIPHCLK_SPI23:
      clocksource = __HAL_RCC_GET_SPI23_SOURCE();

      switch (clocksource)
      {
        case RCC_SPI23CLKSOURCE_PLL1Q: /* PLL1 'Q' is the clock source for SPI2/SPI3 */
          if (__HAL_RCC_GET_PLL1CLKOUT_CONFIG(RCC_PLL_QCLK) != 0U)
          {
            frequency = HAL_RCC_GetPLL1QFreq();
          }
          break;
        case RCC_SPI23CLKSOURCE_PLL2P: /* PLL2 'P' is the clock source for SPI2/SPI3 */
          if (__HAL_RCC_GET_PLL2CLKOUT_CONFIG(RCC_PLL_PCLK) != 0U)
          {
            frequency = HAL_RCC_GetPLL2PFreq();
          }
          break;
        case RCC_SPI23CLKSOURCE_PLL3P: /* PLL3 'P' is the clock source for SPI2/SPI3 */
          if (__HAL_RCC_GET_PLL3CLKOUT_CONFIG(RCC_PLL_PCLK) != 0U)
          {
            frequency = HAL_RCC_GetPLL3PFreq();
          }
          break;
        case RCC_SPI23CLKSOURCE_CLKP: /* CKPER is the clock source for SPI2/SPI3 */
          frequency = RCC_GetCLKPFreq();
          break;
        case RCC_SPI23CLKSOURCE_PIN: /* External I2S_CKIN is used as clock source for SPI2/SPI3 */
          frequency = EXTERNAL_CLOCK_VALUE;
          break;
        default:
          /* Nothing to do, frequency is by default set to 0 */
          break;
      }
      break;

    case RCC_PERIPHCLK_SPI45:
      clocksource = __HAL_RCC_GET_SPI45_SOURCE();

      switch (clocksource)
      {
        case RCC_SPI45CLKSOURCE_PCLK2: /* PCLK2 is the clock source for SPI4/SPI5 */
          frequency = HAL_RCC_GetPCLK2Freq();
          break;
        case RCC_SPI45CLKSOURCE_PLL2Q: /* PLL2 'Q' is the clock source for SPI4/SPI5 */
          if (__HAL_RCC_GET_PLL2CLKOUT_CONFIG(RCC_PLL_QCLK) != 0U)
          {
            frequency = HAL_RCC_GetPLL2QFreq();
          }
          break;
        case RCC_SPI45CLKSOURCE_PLL3Q: /* PLL3 'Q' is the clock source for SPI4/SPI5 */
          if (__HAL_RCC_GET_PLL3CLKOUT_CONFIG(RCC_PLL_QCLK) != 0U)
          {
            frequency = HAL_RCC_GetPLL3QFreq();
          }
          break;
        case RCC_SPI45CLKSOURCE_HSI: /* HSI is the clock source for SPI4/SPI5 */
          if (READ_BIT(RCC->CR, RCC_CR_HSIRDY) != 0U)
          {
            if (READ_BIT(RCC->CR, RCC_CR_HSIDIVF) != 0U)
            {
              frequency = (HSI_VALUE >> (__HAL_RCC_GET_HSI_DIVIDER() >> RCC_CR_HSIDIV_Pos));
            }
            else
            {
              /* Can't retrieve HSIDIV value */
            }
          }
          break;
        case RCC_SPI45CLKSOURCE_CSI: /* CSI is the clock source for SPI4/SPI5 */
          if (READ_BIT(RCC->CR, RCC_CR_CSIRDY) != 0U)
          {
            frequency = CSI_VALUE;
          }
          break;
        case RCC_SPI45CLKSOURCE_HSE: /* HSE is the clock source for SPI4/SPI5 */
          if (READ_BIT(RCC->CR, RCC_CR_HSERDY) != 0U)
          {
            frequency = HSE_VALUE;
          }
          break;
        default:
          /* Nothing to do, frequency is by default set to 0 */
          break;
      }
      break;

    case RCC_PERIPHCLK_SPI6:
      clocksource = __HAL_RCC_GET_SPI6_SOURCE();

      switch (clocksource)
      {
        case RCC_SPI6CLKSOURCE_PCLK4: /* PCLK4 is the clock source for SPI6 */
          frequency = HAL_RCC_GetPCLK4Freq();
          break;
        case RCC_SPI6CLKSOURCE_PLL2Q: /* PLL2 'Q' is the clock source for SPI6 */
          if (__HAL_RCC_GET_PLL2CLKOUT_CONFIG(RCC_PLL_QCLK) != 0U)
          {
            frequency = HAL_RCC_GetPLL2QFreq();
          }
          break;
        case RCC_SPI6CLKSOURCE_PLL3Q: /* PLL3 'Q' is the clock source for SPI6 */
          if (__HAL_RCC_GET_PLL3CLKOUT_CONFIG(RCC_PLL_QCLK) != 0U)
          {
            frequency = HAL_RCC_GetPLL3QFreq();
          }
          break;
        case RCC_SPI6CLKSOURCE_HSI: /* HSI is the clock source for SPI6 */
          if (READ_BIT(RCC->CR, RCC_CR_HSIRDY) != 0U)
          {
            if (READ_BIT(RCC->CR, RCC_CR_HSIDIVF) != 0U)
            {
              frequency = (HSI_VALUE >> (__HAL_RCC_GET_HSI_DIVIDER() >> RCC_CR_HSIDIV_Pos));
            }
            else
            {
              /* Can't retrieve HSIDIV value */
            }
          }
          break;
        case RCC_SPI6CLKSOURCE_CSI: /* CSI is the clock source for SPI6 */
          if (READ_BIT(RCC->CR, RCC_CR_CSIRDY) != 0U)
          {
            frequency = CSI_VALUE;
          }
          break;
        case RCC_SPI6CLKSOURCE_HSE: /* HSE is the clock source for SPI6 */
          if (READ_BIT(RCC->CR, RCC_CR_HSERDY) != 0U)
          {
            frequency = HSE_VALUE;
          }
          break;
        default:
          /* Nothing to do, frequency is by default set to 0 */
          break;
      }
      break;

    case RCC_PERIPHCLK_USART1:
      clocksource = __HAL_RCC_GET_USART1_SOURCE();

      switch (clocksource)
      {
        case RCC_USART1CLKSOURCE_PCLK2: /*!< PCLK2 is the clock source for USART1 */
          frequency = HAL_RCC_GetPCLK2Freq();
          break;
        case RCC_USART1CLKSOURCE_PLL2Q: /*!< PLL2 'Q' is the clock source for USART1 */
          if (__HAL_RCC_GET_PLL2CLKOUT_CONFIG(RCC_PLL_QCLK) != 0U)
          {
            frequency = HAL_RCC_GetPLL2QFreq();
          }
          break;
        case RCC_USART1CLKSOURCE_PLL3Q: /*!< PLL3 'Q' is the clock source for USART1 */
          if (__HAL_RCC_GET_PLL3CLKOUT_CONFIG(RCC_PLL_QCLK) != 0U)
          {
            frequency = HAL_RCC_GetPLL3QFreq();
          }
          break;
        case RCC_USART1CLKSOURCE_HSI: /*!< HSI is the clock source for USART1 */
          if (READ_BIT(RCC->CR, RCC_CR_HSIRDY) != 0U)
          {
            if (READ_BIT(RCC->CR, RCC_CR_HSIDIVF) != 0U)
            {
              frequency = (HSI_VALUE >> (__HAL_RCC_GET_HSI_DIVIDER() >> RCC_CR_HSIDIV_Pos));
            }
            else
            {
              /* Can't retrieve HSIDIV value */
            }
          }
          break;
        case RCC_USART1CLKSOURCE_CSI: /*!< CSI is the clock source for USART1 */
          if (READ_BIT(RCC->CR, RCC_CR_CSIRDY) != 0U)
          {
            frequency = CSI_VALUE;
          }
          break;
        case RCC_USART1CLKSOURCE_LSE: /*!< LSE is the clock source for USART1 */
          if (READ_BIT(RCC->BDCR, RCC_BDCR_LSERDY) != 0U)
          {
            frequency = LSE_VALUE;
          }
          break;
        default:
          /* Nothing to do, frequency is by default set to 0 */
          break;
      }
      break;

    case RCC_PERIPHCLK_USART234578:
      clocksource = __HAL_RCC_GET_USART234578_SOURCE();

      switch (clocksource)
      {
        case RCC_USART234578CLKSOURCE_PCLK1: /*!< PCLK2 is the clock source for USART234578 */
          frequency = HAL_RCC_GetPCLK1Freq();
          break;
        case RCC_USART234578CLKSOURCE_PLL2Q: /*!< PLL2 'Q' is the clock source for USART234578 */
          if (__HAL_RCC_GET_PLL2CLKOUT_CONFIG(RCC_PLL_QCLK) != 0U)
          {
            frequency = HAL_RCC_GetPLL2QFreq();
          }
          break;
        case RCC_USART234578CLKSOURCE_PLL3Q: /*!< PLL3 'Q' is the clock source for USART234578 */
          if (__HAL_RCC_GET_PLL3CLKOUT_CONFIG(RCC_PLL_QCLK) != 0U)
          {
            frequency = HAL_RCC_GetPLL3QFreq();
          }
          break;
        case RCC_USART234578CLKSOURCE_HSI: /*!< HSI is the clock source for USART234578 */
          if (READ_BIT(RCC->CR, RCC_CR_HSIRDY) != 0U)
          {
            if (READ_BIT(RCC->CR, RCC_CR_HSIDIVF) != 0U)
            {
              frequency = (HSI_VALUE >> (__HAL_RCC_GET_HSI_DIVIDER() >> RCC_CR_HSIDIV_Pos));
            }
            else
            {
              /* Can't retrieve HSIDIV value */
            }
          }
          break;
        case RCC_USART234578CLKSOURCE_CSI: /*!< CSI is the clock source for USART234578 */
          if (READ_BIT(RCC->CR, RCC_CR_CSIRDY) != 0U)
          {
            frequency = CSI_VALUE;
          }
          break;
        case RCC_USART234578CLKSOURCE_LSE: /*!< LSE is the clock source for USART234578 */
          if (READ_BIT(RCC->BDCR, RCC_BDCR_LSERDY) != 0U)
          {
            frequency = LSE_VALUE;
          }
          break;
        default:
          /* Nothing to do, frequency is by default set to 0 */
          break;
      }
      break;

    case RCC_PERIPHCLK_USBPHYC:
      clocksource = __HAL_RCC_GET_USBPHYC_SOURCE();

      switch (clocksource)
      {
        case RCC_USBPHYCCLKSOURCE_HSE: /*!< HSE is the clock source for USBPHYC */
          if (READ_BIT(RCC->CR, RCC_CR_HSERDY) != 0U)
          {
            frequency = HSE_VALUE;
          }
          break;
        case RCC_USBPHYCCLKSOURCE_HSE_DIV2: /*!< HSE/2 is the clock source for USBPHYC */
          if (READ_BIT(RCC->CR, RCC_CR_HSERDY) != 0U)
          {
            frequency = (HSE_VALUE >> 1UL);
          }
          break;
        case RCC_USBPHYCCLKSOURCE_PLL3Q: /*!< PLL3Q is the clock source for USBPHYC */
          if (__HAL_RCC_GET_PLL3CLKOUT_CONFIG(RCC_PLL_QCLK) != 0U)
          {
            frequency = HAL_RCC_GetPLL3QFreq();
          }
          break;
        default:
          /* Nothing to do, frequency is by default set to 0 */
          break;
      }
      break;

    case RCC_PERIPHCLK_USBOTGFS:
      clocksource = __HAL_RCC_GET_USBOTGFS_SOURCE();

      switch (clocksource)
      {
        case RCC_USBOTGFSCLKSOURCE_HSI48: /*!< HSI48 is the clock source for USBOTGFS */
          if (READ_BIT(RCC->CR, RCC_CR_HSI48RDY) != 0U)
          {
            frequency = HSI48_VALUE;
          }
          break;
        case RCC_USBOTGFSCLKSOURCE_PLL3Q: /*!< PLL3Q is the clock source for USBOTGFS */
          if (__HAL_RCC_GET_PLL3CLKOUT_CONFIG(RCC_PLL_QCLK) != 0U)
          {
            frequency = HAL_RCC_GetPLL3QFreq();
          }
          break;
        case RCC_USBOTGFSCLKSOURCE_HSE: /*!< HSE is the clock source for USBOTGFS */
          if (READ_BIT(RCC->CR, RCC_CR_HSERDY) != 0U)
          {
            frequency = HSE_VALUE;
          }
          break;
        case RCC_USBOTGFSCLKSOURCE_CLK48: /*!< CLK48 is the clock source for USBOTGFS */
          /* Can't retrieve this source's frequency, it is by default set to 0 */
          break;
        default:
          /* Nothing to do, frequency is by default set to 0 */
          break;
      }
      break;

    default:
      /* Nothing to do, frequency is by default set to 0 */
      break;
  }

